In [17]:
#importing libraries
import pandas as pd
import matplotlib.pyplot as plt
from datasets import load_dataset

#loading data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

#data cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [18]:
#we can see we have a lot of nan values in chose columns
df.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [19]:
#extracting the median value of salary year avg
median_salary_year = df['salary_year_avg'].median()

In [20]:
median_salary_hour = df['salary_hour_avg'].median()

In [ ]:
#we need to replace nan values inside of columns without replacing the current values inside of dataset
#we are creating a new dataset so we don't alter the original dataset
df_filled = df
#specifiying the exact column we want to alter using fillna method
#if we run df_filled dataset it will still be with nan values so we need to set it equal to itself
df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year)

In [23]:
df_filled['salary_year_avg']

0         115000.0
1         115000.0
2         115000.0
3         115000.0
4         115000.0
            ...
785736    115000.0
785737    115000.0
785738    115000.0
785739    115000.0
785740    115000.0
Name: salary_year_avg, Length: 785741, dtype: float64

In [24]:
#doing the same thing for salary_hour_avg column
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_salary_hour)

In [25]:
df_filled.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [ ]:
#using drop_duplicates method in order to return dataframe with duplicate rows removed and also creating a new dataframe
df_unique = df_filled
df_unique = df_unique.drop_duplicates()

#checking how many duplicates were removed
print('Length of original df:        ', len(df_filled))
print('Length of drop duplicates df: ', len(df_unique))
print('Rows dropped:                 ', len(df_filled) - len(df_unique))

Length of original df:         785741
Length of drop duplicates df:  785640
Rows dropped:                  101

In [33]:
#dropping repetative jobs from the same company by filtering job_title and company name
df_unique = df_unique.drop_duplicates(subset=['job_title', 'company_name'])

In [34]:
print('Length of original df:        ', len(df_filled))
print('Length of drop duplicates df: ', len(df_unique))
print('Rows dropped:                 ', len(df_filled) - len(df_unique))

Length of original df:         785741
Length of drop duplicates df:  508042
Rows dropped:                  277699